; domain
(define (domain joint_bar)
(:requirements :strips :equality :typing :adl :conditional-effects)

(:types link angle)

(:predicates
	(AngleOrd ?a - angle ?a1 - angle)
	(HasAngle ?l - angle ?j - link)
	(Affected ?l1 - link ?l2 - link)
    (IsChildOf ?l1 - link ?l2 - link)
)

(:action increase_angle
:parameters (?child_link - link ?a1 ?a2 - angle)
:precondition (and 
	(HasAngle ?a1 ?child_link)
	(AngleOrd ?a1 ?a2)
	)
:effect 
    (and 
	    (not (HasAngle ?a1 ?child_link)) 
	    (HasAngle ?a2 ?child_link)
	    (forall (?ls - link ?a3 ?a4 - angle)
		    (when (and (Affected ?ls ?child_link) (HasAngle ?a3 ?ls) (AngleOrd ?a3 ?a4) )
		        (and
			        (not (HasAngle ?a3 ?ls))
			        (HasAngle ?a4 ?ls)
		        )
		    )
	    )
    )
)

(:action decrease_angle
:parameters (?child_link - link ?a2 ?a1 - angle)
:precondition (and 
	(HasAngle ?a2 ?child_link)
	(AngleOrd ?a1 ?a2)
	)
:effect 
    (and 
	    (not (HasAngle ?a2 ?child_link)) 
	    (HasAngle ?a1 ?child_link)
	    (forall (?ls - link ?a3 ?a4 - angle)
		    (when (and (Affected ?ls ?child_link) (HasAngle ?a4 ?ls) (AngleOrd ?a3 ?a4) )
		        (and
			        (not (HasAngle ?a4 ?ls))
			        (HasAngle ?a3 ?ls)
		        )
		    )
	    )
    )
)
)

; problem
(define (problem joint_bar_6)
(:domain joint_bar)
(:objects
    link1 link2 link3 link4 link5 link6 link7 link8 link9 link10 link11 - link
    angle0 angle45 angle90 angle135 angle180 angle225 angle270 angle315 - angle)
(:init
    (AngleOrd angle0 angle45)
    (AngleOrd angle45 angle90)
    (AngleOrd angle90 angle135)
    (AngleOrd angle135 angle180)
    (AngleOrd angle180 angle225)
    (AngleOrd angle225 angle270)
    (AngleOrd angle270 angle315)
    (AngleOrd angle315 angle0)

    (IsChildOf link2 link1)
    (IsChildOf link3 link2)
    (IsChildOf link4 link3)
    (IsChildOf link5 link4)
    (IsChildOf link6 link5)
    (IsChildOf link7 link6)
    (IsChildOf link8 link7)
    (IsChildOf link9 link8)
    (IsChildOf link10 link9)
    (IsChildOf link11 link10)

    (Affected link2 link1)
    (Affected link3 link1)
    (Affected link3 link2)
    (Affected link4 link1)
    (Affected link4 link2)
    (Affected link4 link3)
    (Affected link5 link1)
    (Affected link5 link2)
    (Affected link5 link3)
    (Affected link5 link4)
    (Affected link6 link1)
    (Affected link6 link2)
    (Affected link6 link3)
    (Affected link6 link4)
    (Affected link6 link5)
    (Affected link7 link1)
    (Affected link7 link2)
    (Affected link7 link3)
    (Affected link7 link4)
    (Affected link7 link5)
    (Affected link7 link6)
    (Affected link8 link1)
    (Affected link8 link2)
    (Affected link8 link3)
    (Affected link8 link4)
    (Affected link8 link5)
    (Affected link8 link6)
    (Affected link8 link7)
    (Affected link9 link1)
    (Affected link9 link2)
    (Affected link9 link3)
    (Affected link9 link4)
    (Affected link9 link5)
    (Affected link9 link6)
    (Affected link9 link7)
    (Affected link9 link8)
    (Affected link10 link1)
    (Affected link10 link2)
    (Affected link10 link3)
    (Affected link10 link4)
    (Affected link10 link5)
    (Affected link10 link6)
    (Affected link10 link7)
    (Affected link10 link8)
    (Affected link10 link9)
    (Affected link11 link1)
    (Affected link11 link2)
    (Affected link11 link3)
    (Affected link11 link4)
    (Affected link11 link5)
    (Affected link11 link6)
    (Affected link11 link7)
    (Affected link11 link8)
    (Affected link11 link9)
    (Affected link11 link10)

    (HasAngle angle135 link1)
    (HasAngle angle180 link2)
    (HasAngle angle90 link3)
    (HasAngle angle45 link4)
    (HasAngle angle90 link5)
    (HasAngle angle180 link6)
    (HasAngle angle0 link7)
    (HasAngle angle270 link8)
    (HasAngle angle45 link9)
    (HasAngle angle90 link10)
    (HasAngle angle90 link11)
)
(:goal
(and
    (HasAngle angle0 link1)
    (HasAngle angle135 link2)
    (HasAngle angle45 link3)
    (HasAngle angle0 link4)
    (HasAngle angle315 link5)
    (HasAngle angle90 link6)
    (HasAngle angle180 link7)
    (HasAngle angle180 link8)
    (HasAngle angle135 link9)
    (HasAngle angle315 link10)
    (HasAngle angle225 link11)
    )
)
)

; plan
1. (decrease_angle link1 angle135 angle90)
   deleted: (hasangle angle135 link1) (hasangle angle180 link2) (hasangle angle90 link3) (hasangle angle45 link4) (hasangle angle90 link5) (hasangle angle180 link6) (hasangle angle0 link7) (hasangle angle270 link8) (hasangle angle45 link9) (hasangle angle90 link10) (hasangle angle90 link11)
   added: (hasangle angle90 link1) (hasangle angle135 link2) (hasangle angle45 link3) (hasangle angle0 link4) (hasangle angle45 link5) (hasangle angle135 link6) (hasangle angle315 link7) (hasangle angle225 link8) (hasangle angle0 link9) (hasangle angle45 link10) (hasangle angle45 link11)
   goals met: 3 of 11
2. (decrease_angle link1 angle90 angle45)
   deleted: (hasangle angle90 link1) (hasangle angle135 link2) (hasangle angle45 link3) (hasangle angle0 link4) (hasangle angle45 link5) (hasangle angle135 link6) (hasangle angle315 link7) (hasangle angle225 link8) (hasangle angle0 link9) (hasangle angle45 link10) (hasangle angle45 link11)
   added: (hasangle angle45 link1) (hasangle angle90 link2) (hasangle angle0 link3) (hasangle angle315 link4) (hasangle angle0 link5) (hasangle angle90 link6) (hasangle angle270 link7) (hasangle angle180 link8) (hasangle angle315 link9) (hasangle angle0 link10) (hasangle angle0 link11)
   goals met: 2 of 11
3. (decrease_angle link1 angle45 angle0)
   deleted: (hasangle angle45 link1) (hasangle angle90 link2) (hasangle angle0 link3) (hasangle angle315 link4) (hasangle angle0 link5) (hasangle angle90 link6) (hasangle angle270 link7) (hasangle angle180 link8) (hasangle angle315 link9) (hasangle angle0 link10) (hasangle angle0 link11)
   added: (hasangle angle0 link1) (hasangle angle45 link2) (hasangle angle315 link3) (hasangle angle270 link4) (hasangle angle315 link5) (hasangle angle45 link6) (hasangle angle225 link7) (hasangle angle135 link8) (hasangle angle270 link9) (hasangle angle315 link10) (hasangle angle315 link11)
   goals met: 3 of 11
4. (decrease_angle link9 angle270 angle225)
   deleted: (hasangle angle270 link9) (hasangle angle315 link10) (hasangle angle315 link11)
   added: (hasangle angle225 link9) (hasangle angle270 link10) (hasangle angle270 link11)
   goals met: 2 of 11
5. (increase_angle link2 angle45 angle90)
   deleted: (hasangle angle45 link2) (hasangle angle315 link3) (hasangle angle270 link4) (hasangle angle315 link5) (hasangle angle45 link6) (hasangle angle225 link7) (hasangle angle135 link8) (hasangle angle225 link9) (hasangle angle270 link10) (hasangle angle270 link11)
   added: (hasangle angle90 link2) (hasangle angle0 link3) (hasangle angle315 link4) (hasangle angle0 link5) (hasangle angle90 link6) (hasangle angle270 link7) (hasangle angle180 link8) (hasangle angle270 link9) (hasangle angle315 link10) (hasangle angle315 link11)
   goals met: 4 of 11
6. (increase_angle link2 angle90 angle135)
   deleted: (hasangle angle90 link2) (hasangle angle0 link3) (hasangle angle315 link4) (hasangle angle0 link5) (hasangle angle90 link6) (hasangle angle270 link7) (hasangle angle180 link8) (hasangle angle270 link9) (hasangle angle315 link10) (hasangle angle315 link11)
   added: (hasangle angle135 link2) (hasangle angle45 link3) (hasangle angle0 link4) (hasangle angle45 link5) (hasangle angle135 link6) (hasangle angle315 link7) (hasangle angle225 link8) (hasangle angle315 link9) (hasangle angle0 link10) (hasangle angle0 link11)
   goals met: 4 of 11
7. (decrease_angle link5 angle45 angle0)
   deleted: (hasangle angle45 link5) (hasangle angle135 link6) (hasangle angle315 link7) (hasangle angle225 link8) (hasangle angle315 link9) (hasangle angle0 link10) (hasangle angle0 link11)
   added: (hasangle angle0 link5) (hasangle angle90 link6) (hasangle angle270 link7) (hasangle angle180 link8) (hasangle angle270 link9) (hasangle angle315 link10) (hasangle angle315 link11)
   goals met: 7 of 11
8. (decrease_angle link11 angle315 angle270)
   deleted: (hasangle angle315 link11)
   added: (hasangle angle270 link11)
   goals met: 7 of 11
9. (increase_angle link10 angle315 angle0)
   deleted: (hasangle angle315 link10) (hasangle angle270 link11)
   added: (hasangle angle0 link10) (hasangle angle315 link11)
   goals met: 6 of 11
10. (decrease_angle link9 angle270 angle225)
   deleted: (hasangle angle270 link9) (hasangle angle0 link10) (hasangle angle315 link11)
   added: (hasangle angle225 link9) (hasangle angle315 link10) (hasangle angle270 link11)
   goals met: 7 of 11
11. (decrease_angle link11 angle270 angle225)
   deleted: (hasangle angle270 link11)
   added: (hasangle angle225 link11)
   goals met: 8 of 11
12. (increase_angle link10 angle315 angle0)
   deleted: (hasangle angle315 link10) (hasangle angle225 link11)
   added: (hasangle angle0 link10) (hasangle angle270 link11)
   goals met: 6 of 11
13. (decrease_angle link7 angle270 angle225)
   deleted: (hasangle angle270 link7) (hasangle angle180 link8) (hasangle angle225 link9) (hasangle angle0 link10) (hasangle angle270 link11)
   added: (hasangle angle225 link7) (hasangle angle135 link8) (hasangle angle180 link9) (hasangle angle315 link10) (hasangle angle225 link11)
   goals met: 7 of 11
14. (decrease_angle link9 angle180 angle135)
   deleted: (hasangle angle180 link9) (hasangle angle315 link10) (hasangle angle225 link11)
   added: (hasangle angle135 link9) (hasangle angle270 link10) (hasangle angle180 link11)
   goals met: 6 of 11
15. (increase_angle link8 angle135 angle180)
   deleted: (hasangle angle135 link8) (hasangle angle135 link9) (hasangle angle270 link10) (hasangle angle180 link11)
   added: (hasangle angle180 link8) (hasangle angle180 link9) (hasangle angle315 link10) (hasangle angle225 link11)
   goals met: 8 of 11
16. (decrease_angle link5 angle0 angle315)
   deleted: (hasangle angle0 link5) (hasangle angle90 link6) (hasangle angle225 link7) (hasangle angle180 link8) (hasangle angle180 link9) (hasangle angle315 link10) (hasangle angle225 link11)
   added: (hasangle angle315 link5) (hasangle angle45 link6) (hasangle angle180 link7) (hasangle angle135 link8) (hasangle angle135 link9) (hasangle angle270 link10) (hasangle angle180 link11)
   goals met: 7 of 11
17. (increase_angle link6 angle45 angle90)
   deleted: (hasangle angle45 link6) (hasangle angle180 link7) (hasangle angle135 link8) (hasangle angle135 link9) (hasangle angle270 link10) (hasangle angle180 link11)
   added: (hasangle angle90 link6) (hasangle angle225 link7) (hasangle angle180 link8) (hasangle angle180 link9) (hasangle angle315 link10) (hasangle angle225 link11)
   goals met: 9 of 11
18. (increase_angle link10 angle315 angle0)
   deleted: (hasangle angle315 link10) (hasangle angle225 link11)
   added: (hasangle angle0 link10) (hasangle angle270 link11)
   goals met: 7 of 11
19. (decrease_angle link7 angle225 angle180)
   deleted: (hasangle angle225 link7) (hasangle angle180 link8) (hasangle angle180 link9) (hasangle angle0 link10) (hasangle angle270 link11)
   added: (hasangle angle180 link7) (hasangle angle135 link8) (hasangle angle135 link9) (hasangle angle315 link10) (hasangle angle225 link11)
   goals met: 10 of 11
20. (decrease_angle link9 angle135 angle90)
   deleted: (hasangle angle135 link9) (hasangle angle315 link10) (hasangle angle225 link11)
   added: (hasangle angle90 link9) (hasangle angle270 link10) (hasangle angle180 link11)
   goals met: 7 of 11
21. (increase_angle link8 angle135 angle180)
   deleted: (hasangle angle135 link8) (hasangle angle90 link9) (hasangle angle270 link10) (hasangle angle180 link11)
   added: (hasangle angle180 link8) (hasangle angle135 link9) (hasangle angle315 link10) (hasangle angle225 link11)
   goals met: 11 of 11
